_posts/technology/2022-12-20-cppcoreguidelines-c135.html
---
layout: post
title: CppCoreGuidelines C.135 使用多重继承来表达多重不同的接口
categories: [technology]
tags: [CppCoreGuidelines]
---

<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Use multiple inheritance to represent multiple distinct interfaces&rdquo;
</p>


<p>
理由
</p>

<p>
并非所有的类要支持所有的接口。也并非所有的调用处都必须处理所有的操作。因此，可以通过派生类将一组庞大的接口拆分成不同的行为侧面。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">iostream</span> : <span style="color: #7F0055; font-weight: bold;">public</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">istream</span>, <span style="color: #7F0055; font-weight: bold;">public</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">ostream</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">very simplified</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>


<p>
istream 提供输入操作的接口，ostream 提供输出操作的接口。iostream 提供
istream 和 ostream 操作的合集，以及输入输出需要的同步操作。
</p>


<p>
注意
</p>

<p>
这是经常用到继承的地方，因为某个实现需要多个不同的接口，而这些接口又很难通过单一根节点的继承层级来实现。
</p>

<p>
这些接口通常都是抽象类。
</p>
